🚀&nbsp; env0 had composed a PR Plan for environment [asd / null for each-77561 ](http://dev.dev.env0.com/p/af1f8624-5f4c-41f9-bb9f-4d0c1f3280ea/environments/bc6dbd3d-3580-451f-a22c-1e3f2f206f47):
```
Plan: 4 to add, 0 to change, 2 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform will perform the following actions:


  # local_file.example["file1.txt"] will be created
+   resource "local_file" "example" {
+       content              = "Content for file 1"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "file1.txt"
+       id                   = (known after apply)
    }


  # local_file.example["file2.txt"] will be created
+   resource "local_file" "example" {
+       content              = "Content for file 2"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "file2.txt"
+       id                   = (known after apply)
    }

  # local_file.example["file3.txt"] will be created
+   resource "local_file" "example" {
+       content              = "Content for file 3"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "file3.txt"
+       id                   = (known after apply)
    }

  # null_resource.null2["aaa"] will be destroyed
  # (because key ["aaa"] is not in for_each map)
-   resource "null_resource" "null2" {
-       id = "9084896206205462400" -> null
    }

  # null_resource.null2["aaa.yarivvvvvvvvvvvvvvvv.trying.to.do.a.very.long.resource.maybe.it.will.reproduce"] will be created
+   resource "null_resource" "null2" {
+       id = (known after apply)
    }

  # null_resource.null2["bbb"] will be destroyed
  # (because key ["bbb"] is not in for_each map)
-   resource "null_resource" "null2" {
-       id = "2329644288405982017" -> null
    }

Plan: 4 to add, 0 to change, 2 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "yariv2" but a value was
│ found in file "env0.auto.tfvars.json". If you meant to use this value, add
│ a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "asd" but a value was
│ found in file "env0.auto.tfvars.json". If you meant to use this value, add
│ a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│ 
│ In addition to the other similar warnings shown, 5 other variable(s)
│ defined without being declared.
╵
```
</details>


```
There are no cost estimation changes
```


[Full PR Plan logs on env0](http://dev.dev.env0.com/p/af1f8624-5f4c-41f9-bb9f-4d0c1f3280ea/environments/bc6dbd3d-3580-451f-a22c-1e3f2f206f47/deployments/e5787f4b-219f-416d-bee2-94a999ca9ec6)